USE configurator;

INSERT configurator.users(first_name, last_name, phone_number, mail)
VALUES 
	('Виталий', 'Яицкий', 89880939505, 'logist26rus@gmail.com'),
    ('Артем', 'Кузнецов', 89039553020, 'kuznec_ar@gmail.com'),
    ('Артем', 'Куценко', 89881000050, 'kuc_ar@gmail.com'),
    ('Алексей', 'Закатянский', 89282583040, 'zac_al@gmail.com'),
    ('Дмитрий', 'Тарануха', 89182503223, 'dima0990@gmail.com'),
    ('Алексей', 'Егорушкин', 89324592554, 'egorushkin26@gmail.com'),
    ('Виктор', 'Иванников', 89382352032, 'ivannikov32@gmail.com'),
    ('Александр', 'Яицкий', 89883244565, 'alex007@gmail.com'),
    ('Александр', 'Балаба',89389502552 , 'vertu_st@gmail.com'),
    ('Евгения', 'Лапонова', 89622344554, 'evgeniya_stav@gmail.com');
    
INSERT configurator.case_fans(title, `description`, price_case_fans)
VALUES 
	('Комплект вентиляторов DEEPCOOL RF120', 
	'Максимальная скорость вращения 1500 об/мин
		Минимальная скорость вращения 500 об/мин
		Воздушный поток на максимальной скорости 56.5 CFM
		Максимальное статическое давление 16.3 Па
		Максимальный уровень шума 27 дБ
		Минимальный уровень шума 17.8 дБ', 2699),
	
    ('Вентилятор Xilence XF039', 
    'Максимальная скорость вращения 1300 об/мин
		Минимальная скорость вращения 1300 об/мин
		Воздушный поток на максимальной скорости 44.71 CFM
		Максимальный уровень шума 22 дБ 
        Минимальный уровень шума 22 дБ', 299),
	
    ('Вентилятор Aerocool Frost 12 PWM FRGB',
    'Максимальная скорость вращения 1500 об/мин
		Минимальная скорость вращения 500 об/мин
		Воздушный поток на максимальной скорости 28.2 CFM
		Максимальное статическое давление 11.4 Па
		Максимальный уровень шума 27.5 дБ
		Минимальный уровень шума 18.2 дБ', 390),
	
    ('Вентилятор Aerocool Rev RGB',
	'Максимальная скорость вращения 1200 об/мин
		Минимальная скорость вращения 1200 об/мин
		Воздушный поток на максимальной скорости 41.3 CFM 
        Максимальное статическое давление 9.6 Па
		Максимальный уровень шум 15.1 дБ
		Минимальный уровень шума 15.1 дБ', 750),
	
    ('Комплект вентиляторов Aerocool Duo 12 PRO',
    ' Максимальная скорость вращения 1000 об/мин
		Минимальная скорость вращения 1000 об/мин
		Воздушный поток на максимальной скорости 33.4 CFM
		Максимальное статическое давление 12.6 Па
		Максимальный уровень шума 19.7 дБ
		Минимальный уровень шума 19.7 дБ', 2699),
        
	('Комплект вентиляторов LIAN LI UNI FAN SL Infinity 120',
    ' Максимальная скорость вращения 2200 об/мин
		Минимальная скорость вращения 2200 об/мин
		Воздушный поток на максимальной скорости 61.3 CFM
		Максимальное статическое давление 26 Па
		Максимальный уровень шума 29 дБ
		Минимальный уровень шума нет', 7399),
        
	('Комплект вентиляторов LIAN LI UNI FAN SL Infinity 120',
	'Максимальная скорость вращения 2200 об/мин
		Минимальная скорость вращения нет
		Воздушный поток на максимальной скорости 61.3 CFM
		Максимальное статическое давление 26 Па
		Максимальный уровень шума 29 дБ
		Минимальный уровень шума нет', 7299),
	
    ('Вентилятор Aerocool Rev Blue',
    ' Максимальная скорость вращения 1200 об/мин
		Минимальная скорость вращения 1200 об/мин
		Воздушный поток на максимальной скорости 41.3 CFM
		Максимальное статическое давление 9.6 Па
		Максимальный уровень шума 15.1 дБ
		Минимальный уровень шума 15.1 дБ', 599),
	
    ('Комплект вентиляторов DEEPCOOL CF120 Plus', 
    ' Максимальная скорость вращения 1800 об/мин
		Минимальная скорость вращения 500 об/мин
		Воздушный поток на максимальной скорости 52.5 CFM
		Максимальное статическое давление 20.4 Па
		Максимальный уровень шума 28.8 дБ', 4099),
	
    ('Комплект вентиляторов DEEPCOOL CF120', 
    ' Максимальная скорость вращения 1500 об/мин
		Минимальная скорость вращения 500 об/мин
		Воздушный поток на максимальной скорости 56.5 CFM
		Максимальное статическое давление 16 Па
		Максимальный уровень шума 27 дБ
		Минимальный уровень шума 17.8 дБ', 3399);
        
INSERT configurator.CPU(title, `description`, price_cpu)
VALUES 
	('Процессор AMD Ryzen 5 5600X OEM', 
	'Линейка процессора Ryzen 5
	Архитектура Zen
	Сокет процессора AM4
	Базовая частота, ГГц 3.7
	Турбо-частота, ГГц 4.6
	Количество ядер 6
	Количество потоков 12
	Кэш L3, МБ32
	Техпроцесс 7 нм
	Тепловыделение Вт 65', 17420),
	
    ('Процессор AMD Ryzen 5 3600 OEM', 
    'Линейка процессора Ryzen 5
	Архитектура Picasso
	Сокет процессора AM4
	Базовая частота, ГГц 3.6
	Турбо-частота, ГГц 4.2
	Количество ядер 6
	Количество потоков 12
	Кэш L3, МБ 32
	Техпроцесс 7 нм
	Тепловыделение, Вт 65', 13053),
	
    ('Процессор Intel Core i5-11400F OEM',
    'Линейка процессора Core i5 11-го поколения
    Архитектура Rocket Lake
    Сокет процессора LGA 1200
	Базовая частота, ГГц 2.6
	Турбо-частота, ГГц 4.4
	Количество ядер 6
	Количество потоков 12 Кэш L3, МБ 12
	Техпроцесс 14 нм
	Тепловыделение, Вт 65', 11894),
	
    ('Процессор AMD Ryzen 7 5800X OEM',
	'Линейка процессора Ryzen 7
	Архитектура Zen
	Сокет процессора AM4
	Базовая частота, ГГц 3.8
	Турбо-частота, ГГц 4.6
	Количество ядер 8
	Количество потоков 16
	Кэш L3, МБ 32
	Техпроцесс 7 нм
	Тепловыделение, Вт 105', 22491),
	
    ('Процессор AMD Ryzen 9 5900X OEM',
    ' Линейка процессора Ryzen 9
	Архитектура Zen
	Сокет процессора AM4
	Количество ядер 12
	Количество потоков 24
	Кэш L3, МБ 64
	Техпроцесс 7 нм
	Тепловыделение, Вт 105
	Кэш L1, КБ 768
	Кэш L2, КБ 6000', 29230),
        
	('Процессор Intel Core i7-12700KF OEM',
    'Линейка процессора Core i7 12-го поколения
	Архитектура Alder Lake
	Сокет процессора LGA 1700
	Базовая частота, ГГц 3.6
	Турбо-частота, ГГц 5
	Количество ядер 12
	Количество потоков 20
	Кэш L3, МБ 25
	Техпроцесс 10 нм
	Тепловыделение, Вт 125', 30618),
        
	('Процессор Intel Core i5-10400F OEM',
	'Линейка процессора Core i5 10-го поколения
	Архитектура Comet Lake
	Сокет процессора LGA 1200
	Базовая частота, ГГц 2.9
	Турбо-частота, ГГц 4.3
	Количество ядер 6
	Количество потоков 12
	Кэш L3, МБ 12
	Техпроцесс 14 нм
	Тепловыделение, Вт 65', 8992),
	
    ('Процессор AMD Ryzen 5 5600G BOX',
    'Линейка процессора Ryzen 5
	Архитектура Zen
	Сокет процессора AM4
	Базовая частота, ГГц 3.9
	Турбо-частота, ГГц 4.4
	Количество ядер 6
	Количество потоков 12
	Кэш L3, МБ 16
	Техпроцесс 7 нм
	Тепловыделение, Вт 65', 10775),
	
    ('Процессор AMD Ryzen 7 5700G OEM', 
    'Линейка процессора Ryzen 7
	Сокет процессора AM4
	Базовая частота, ГГц 3.8
	Турбо-частота, ГГц 4.6
	Количество ядер 8
	Количество потоков 16
	Кэш L3, МБ 16
	Техпроцесс 7 нм
	Тепловыделение, Вт 65
	Кэш L1, КБ 256', 13688),
	
    ('Процессор Intel Core i3-10105F OEM', 
    'Линейка процессора Core i3 10-го поколения
	Архитектура Comet Lake
	Сокет процессора LGA 1200
	Базовая частота, ГГц 3.7
	Турбо-частота, ГГц 4.4
	Количество ядер 4
	Количество потоков 8
	Кэш L3, МБ 6
	Техпроцесс 14 нм
	Тепловыделение, Вт 65', 8228);
    
    use configurator;

INSERT configurator.CPU_Cooling(title, `description`, price_CPU_Cooling)
VALUES 
	('Кулер для процессора DEEPCOOL GAMMAXX 300', 
	'Макс. рассеиваемая мощность, Вт 130
	Высота вентилятора, мм 25
	Количество вентиляторов 1
	Макс. скорость вращения, об/мин 1600
	Макс. воздушный поток, CFM 55.5
	Назначение кулера Для процессора
	Цвет Черный, синий
	Диаметр вентилятора, мм 120
	Тип подшипника Гидродинамический', 997),
	
    ('Кулер для процессора be quiet! DARK ROCK PRO 4', 
    'максимальная рассеиваемая мощность (TDP) 250 Вт
	высота кулера 163 мм
	сокет AM2, AM2+, AM3, AM3+, AM4, FM1, FM2, FM2+, 
	LGA 1150, LGA 1151, LGA 1151-v2, LGA 1155, LGA 1156, 
	LGA 1200, LGA 1356, LGA 1366, LGA 2011 (Square ILM), 
	LGA 2011-3 (Square ILM), LGA 2066
	количество тепловых трубок 7
	материал радиатора алюминий
	количество вентиляторов 2
	диаметр вентилятора 120, 135
	уровень шума 12.8-24.3 дБ 
	скорость 1500 об/мин, регулятор оборотов
	тип коннектора 4-pin PWM
	тип подшипника гидродинамический
	ГхШхВ 146х136х163 мм', 9669),
	
    ('Кулер для процессора DEEPCOOL AK620',
    'Макс. рассеиваемая мощность, Вт 260
	Количество вентиляторов 2
	Макс. скорость вращения, об/мин 1850
	Макс. воздушный поток, CFM 68.99
	Назначение кулера Для процессора
	Цвет Серебристый, черный
	Диаметр вентилятора, мм 120
	Тип подшипника Гидродинамический
	Высота, мм 160', 11894),
	
    ('Кулер для процессора DEEPCOOL GAMMAXX 400 V2 Blue',
	'Макс. рассеиваемая мощность, Вт 180
	Высота вентилятора, мм 25
	Количество вентиляторов 1
	Макс. скорость вращения, об/мин 1650
	Макс. воздушный поток, CFM 65
	Назначение кулера Для процессора
	Диаметр вентилятора, мм 120
	Тип подшипника Гидродинамический
	Высота, мм 155', 1595),
	
    ('Кулер для процессора DEEPCOOL AK400',
	'Макс. рассеиваемая мощность, Вт 220
	Высота вентилятора, мм 25
	Сокет процессора AM4, AM5, LGA 1150, LGA 1151, LGA 1155, LGA 1200, LGA 1700
	Количество вентиляторов 1
	Макс. скорость вращения, об/мин 1850
	Макс. воздушный поток, CFM 66.47
	Назначение кулера Для процессора
	ЦветЧерный
	Диаметр вентилятора, мм 120', 2830),
        
	('Кулер для процессора DEEPCOOL GAMMAXX 200T',
    'Макс. рассеиваемая мощность, Вт 100
	Высота вентилятора, мм 25
	Количество вентиляторов 1
	Макс. скорость вращения, об/мин 1600
	Макс. воздушный поток, CFM 55
	Назначение кулера Для процессора
	Цвет Голубой
	Диаметр вентилятора, мм120Тип 
	подшипника Гидродинамический', 953),
        
	('Система охлаждения DEEPCOOL GAMMAXX L240 V2',
	'Высота вентилятора, мм 25
	Количество вентиляторов 2
	Макс. скорость вращения, об/мин 1800
	Макс. воздушный поток, CFM 70
	Назначение кулера Для процессора
	Диаметр вентилятора, мм 120
	Тип подшипника Гидродинамический
	Высота, мм 120
	Ширина, мм 282
	Глубина, мм 27', 4551),
	
    ('Система охлаждения LIAN LI Galahad AIO UNI FAN SL Edition 360',
    ' Количество вентиляторов в комплекте 3
	Размеры вентиляторов  120 x 120 мм
	Тип подшипника вентилятора скольжения (гидродинамический) 
	Минимальная скорость вращения 800 об/мин
	Максимальная скорость вращения 1900 об/мин
	Регулировка скорости вращения вентилятора автоматическая (PWM)
	Максимальный уровень шума 31 дБ
	Максимальный воздушный поток 58.54 CFM
	Максимальное статическое давление 24.9 Па
	Разъем подключения вентиляторов 4 pin', 22299),
	
    ('Система охлаждения ID-Cooling ZOOMFLOW 360X ARGB', 
    ' Количество вентиляторов в комплекте 3
	Размеры вентиляторов 120 x 120 мм
	Тип подшипника вентилятора скольжения (гидродинамический)
	Минимальная скорость вращения 700 об/мин
	Максимальная скорость вращения 1500 об/мин 
	Регулировка скорости вращения вентилятора автоматическая (PWM)
	Минимальный уровень шума 18 дБ
	Максимальный уровень шума 26.4 дБ
	Максимальный воздушный поток 62 CFM
	Максимальное статическое давление 17.5 Па
	Разъем подключения вентиляторов 4 pin', 9099),
	
    ('Система охлаждения DEEPCOOL GAMMAXX L240T BLUE', 
    ' Количество вентиляторов в комплекте 2
	Размеры вентиляторов 120 x 120 мм
	Тип подшипника вентилятора скольжения (гидродинамический)
	Минимальная скорость вращения 500 об/мин
	Максимальная скорость вращения 1800 об/мин
	Регулировка скорости вращения вентилятора автоматическая (PWM)
	Максимальный уровень шума 30 дБ
	Максимальный воздушный поток 69.34 CFM
	Максимальное статическое давление 23.7 Па
	Разъем подключения вентиляторов 4 pin', 4999);
    
    INSERT configurator.DATA_storage(title, `description`, price_DATA_storage)
VALUES 
	('1000 ГБ SSD M.2 накопитель Samsung 980', 
	'Форм-фактор M.2
	Интерфейс SSD PCI-E 3.0
	Тип флеш-памяти 3D NAND
	Ресурс SSD (TBW) 600
	Время наработки на отказ, ч 1500000
	Контроллер Samsung
	Потребляемая мощность (режим ожидания), Вт 3.7
	Объем 1 ТБ
	Скорость чтения, Мб/с 3500
	Скорость записи, Мб/с 3000', 7990),
	
    ('1000 ГБ SSD M.2 накопитель Kingston NV1', 
    'Форм-фактор M.2
	Интерфейс SSD PCI-E 3.0
	Тип флеш-памяти 3D NAND
	Ресурс SSD (TBW) 240
	Время наработки на отказ, ч 1500000
	Потребляемая мощность (режим ожидания), Вт 0.05
	Цвет Черно-серый
	Объем 1 ТБ
	Скорость чтения, Мб/с 2100
	Скорость записи, Мб/с 1700', 5306),
	
    ('500 ГБ SSD M.2 накопитель Kingston NV1',
    'Форм-фактор M.2
	Интерфейс SSD PCI-E 3.0
	Тип флеш-памяти 3D TLC NAND
	Ресурс SSD (TBW) 120
	Время наработки на отказ, ч 1500000
	Потребляемая мощность (режим ожидания), Вт 0.05
	Цвет Черно-серый
	Объем 500 ГБ
	Скорость чтения, Мб/с 2100
	Скорость записи, Мб/с 1700', 2958),
	
    ('1000 ГБ SSD M.2 накопитель Samsung 980 PRO',
	'Форм-фактор M.2
	Интерфейс SSD PCI-E 4.0
	Тип флеш-памяти MLC 3D NAND
	Ресурс SSD (TBW) 600
	Время наработки на отказ, ч 1500000
	Контроллер Samsung
	Потребляемая мощность (режим ожидания), Вт 0.035
	Цвет Черный
	Объем 1 ТБ
	Скорость чтения, Мб/с 7000', 10440);
    
    INSERT configurator.frame(title, `description`, price_frame)
VALUES 
	('Корпус Cougar MX330-F черный', 
	'Типоразмер корпуса Mid-Tower
	Ориентация материнской платы вертикально
	Длина 427 мм
	Ширина 195 мм
	Высота 473 мм
	Вес 5.9 кг', 5599),
	
    ('Корпус DEEPCOOL MATREXX 55 MESH ADD-RGB 4F', 
    'Типоразмер корпуса Mid-Tower
	Ориентация материнской платы вертикально
	Длина 435 мм
	Ширина 210 мм
	Высота 478 мм
	Вес 6.6 кг
     Материал корпуса сталь, стекло, пластик', 7199),
	
    ('Корпус Cougar PANZER MAX-G',
    'Типоразмер корпуса Full-Tower
	Ориентация материнской платы вертикально
	Длина 556 мм
	Ширина 266 мм
	Высота 612 мм
	Вес 12.76 кг
	Материал корпуса сталь, стекло, пластик', 14499),
	
    ('Корпус DEEPCOOL MATREXX 70 3F',
	'Типоразмер корпуса Mid-Tower
	Ориентация материнской платы вертикально
	Длина 492 мм
	Ширина 228 мм
	Высота 475 мм
	Вес 9.39 кг
     Материал корпуса сталь, стекло, пластик', 9199);
     
INSERT configurator.GPU(title, `description`, price_GPU)
VALUES 
	('Видеокарта GIGABYTE GeForce RTX 3070 GAMING OC', 
	'Объем видеопамяти 8 ГБ
	Тип памяти GDDR6
	Разрядность шины памяти 256 бит
	Максимальная пропускная способность памяти 448 Гбайт/сек
	Эффективная частота памяти 14000 МГц', 51499),
	
    ('Видеокарта GIGABYTE GeForce RTX 3080 Ti EAGLE OC', 
    'Объем видеопамяти 12 ГБ
	Тип памяти GDDR6X
	Разрядность шины памяти 384 бит
	Максимальная пропускная способность памяти 912 Гбайт/сек
	Эффективная частота памяти 19000 МГц', 93999),
	
    ('Видеокарта ASUS GeForce RTX 3060 STRIX GAMING OC',
    'Объем видеопамяти 12 ГБ
	Тип памяти GDDR6
	Разрядность шины памяти 192 бит
	Максимальная пропускная способность памяти 360 Гбайт/сек
	Эффективная частота памяти 15000 МГц', 47999),
	
    ('Видеокарта GIGABYTE GeForce RTX 3080 VISION OC',
	'Объем видеопамяти 10 ГБ
	Тип памяти GDDR6X
	Разрядность шины памяти 320 бит
	Максимальная пропускная способность памяти 760 Гбайт/сек
	Эффективная частота памяти 19000 МГц', 74999);
    
INSERT configurator.motherboard(title, `description`, price_motherboard)
VALUES 
	('Материнская плата GIGABYTE B550 AORUS ELITE V2', 
	'Сокет AM4
	Чипсет AMD AMD B550
	Совместимые ядра процессоров AMD Vermeer, Renoir, Matisse
	Количество слотов памяти 4
	Форм фактор поддерживаемой памяти DIMM
	Тип поддерживаемой памяти DDR4
	Количество каналов памяти 2
	Максимальный объем памяти 128 ГБ
	Максимальная частота памяти (JEDEC/без разгона) 3200 МГц
	Частота оперативной памяти в разгоне 3400 МГц, 3466 МГц, 3600 МГц, 3733 МГц, 3866 МГц, 4000 МГц,
	4133 МГц, 4266 МГц, 4400 МГц, 4600 МГц, 4733 МГц', 11999),
	
    ('Материнская плата MSI MAG Z690 TOMAHAWK WIFI', 
    'Сокет LGA 1700
	Чипсет Intel Intel Z690
	Совместимые ядра процессоров Intel Alder Lake
	Количество слотов памяти 4
	Форм фактор поддерживаемой памяти DIMM
	Тип поддерживаемой памяти DDR5
	Количество каналов памяти 2
	Максимальный объем памяти 128 ГБ
	Максимальная частота памяти (JEDEC/без разгона) 4800 МГц
	Частота оперативной памяти в разгоне
	4000 МГц, 4800 МГц, 5000 МГц, 5200 МГц, 5300 МГц, 5400 МГц, 
	5600 МГц, 5800 МГц, 6000 МГц, 6200 МГц', 21999),
	
    ('Материнская плата GIGABYTE Z690 GAMING X DDR4',
    'Сокет LGA 1700
	Чипсет Intel Intel Z690
	Совместимые ядра процессоров Intel Alder Lake
	Количество слотов памяти 4
	Форм фактор поддерживаемой памяти DIMM
	Тип поддерживаемой памяти DDR4
	Количество каналов памяти 2
	Максимальный объем памяти 128 ГБ
	Максимальная частота памяти (JEDEC/без разгона) 3200 МГц', 16999),
	
    ('Материнская плата MSI MPG Z690 EDGE WIFI',
	'Сокет LGA 1700
	Чипсет Intel Z690
	Совместимые ядра процессоров Intel Alder Lake
	Количество слотов памяти 4
	Форм фактор поддерживаемой памяти DIMM
	Тип поддерживаемой памяти DDR5
	Количество каналов памяти 2
	Максимальный объем памяти 128 ГБ
	Максимальная частота памяти (JEDEC/без разгона) 4800 МГц
	Частота оперативной памяти в разгоне
	4000 МГц, 4400 МГц, 4600 МГц, 4800 МГц, 5200 МГц, 5300 МГц, 
	5400 МГц, 5600 МГц, 5800 МГц, 6000 МГц, 6200 МГц, 6400 МГц', 27999);
    
INSERT configurator.Power_Supply(title, `description`, price_Power_Supply)
VALUES 
	('Блок питания DEEPCOOL DQ750 ', 
	'Мощность по линии 12 В 744 Вт
	Ток по линии +12 В 12V2 62A
	Ток по линии +3.3 В 20 А
	Ток по линии +5 В 20 А
	Ток дежурного источника (+5 В Standby) 2.5 А
	Ток по линии -12 В 0.3 А
	Диапазон входного напряжения сети 100-240 В 50/60 Гц
	Сертификат 80 PLUS Gold
	Корректор коэффициента мощности (PFC) активный
	Соответствие стандартам ATX 12V 2.3
	Технологии защиты
	OPP, OCP, OVP, OTP, UVP, SCP', 8699),
	
    ('Блок питания DEEPCOOL DQ850 ', 
    'Мощность по линии 12 В 850 Вт
	Ток по линии +12 В 12V1 70.5A
	Ток по линии +3.3 В 20 А
	Ток по линии +5 В 20 А
	Ток дежурного источника (+5 В Standby) 2.5 А
	Ток по линии -12 В 0.3 А
	Диапазон входного напряжения сети 100-240 В 47/63 Гц
	Сертификат 80 PLUS Gold
	Корректор коэффициента мощности (PFC) активный
	Соответствие стандартам ATX 12V 2.3
	Технологии защиты OPP, OCP, OVP, OTP, UVP, SCP', 9899),
	
    ('Блок питания DEEPCOOL DQ750ST',
    'Мощность по линии 12 В 744 Вт
	Ток по линии +12 В 12V1 62A
	Ток по линии +3.3 В 22 А
	Ток по линии +5 В 22 А
	Ток дежурного источника (+5 В Standby) 2.5 А
	Ток по линии -12 В 0.3 А
	Диапазон входного напряжения сети 100-240 В 50/60 Гц
	Сертификат 80 PLUS Gold
	Корректор коэффициента мощности (PFC) активный
	Соответствие стандартам ATX 12V 2.31
	Технологии защиты OPP, OVP, UVP, SCP', 6399),
	
    ('Блок питания ZALMAN GigaMax (GVII) 750W',
	'Мощность по линии 12 В 744 Вт
	Ток по линии +12 В 12V1 62A
	Ток по линии +3.3 В 20 А
	Ток по линии +5 В 20 А
	Ток дежурного источника (+5 В Standby) 2.5 А
	Ток по линии -12 В 0.3 А
	Диапазон входного напряжения сети 200-240 В 50/60 Гц
	Сертификат 80 PLUS Bronze
	Корректор коэффициента мощности (PFC) активный
	Соответствие стандартам ATX 12V 2.31
	Технологии защиты OPP, OCP, OVP, OTP, UVP, SCP', 4699);
    
INSERT configurator.RAM(title, `description`, price_RAM)
VALUES 
	('Оперативная память AMD Radeon R9 Gamer Series 32Gb', 
	'Тип памяти DDR4
	Форм-фактор памяти DIMM
	Суммарный объем памяти всего комплекта 32 ГБ
	Объем одного модуля памяти 16 ГБ
	Количество модулей в комплекте 2
	Регистровая память нет
	ECC-память нет
	Тактовая частота 3200 МГц
	Профили Intel XMP 3200 МГц (16-18-18-39)', 7099),
	
    ('Оперативная память Kingston FURY Beast Black 16Gb', 
    'Тип памяти DDR4
	Форм-фактор памяти DIMM
	Суммарный объем памяти всего комплекта 16 ГБ
	Объем одного модуля памяти 8 ГБ
	Количество модулей в комплекте 2
	Регистровая память нет
	ECC-память нет
	Ранговость одноранговая
	Тактовая частота 3200 МГц
	Профили Intel XMP 3000 МГц (15-17-17), 3200 МГц (16-18-18)', 
    4899),
	
    ('Оперативная память Kingston FURY Beast Black 32Gb',
    'Тип памяти DDR4
	Форм-фактор памяти DIMM
	Суммарный объем памяти всего комплекта 32 ГБ
	Объем одного модуля памяти 16 ГБ
	Количество модулей в комплекте 2
	Регистровая память нет
	ECC-память нет
	Ранговость одноранговая
	Тактовая частота 3200 МГц
	Профили Intel XMP
	3200 МГц (16-20-20)', 8599 ),
	
    ('Оперативная память AMD Radeon R7 Performance Series 16Gb',
	'Тип памяти DDR4
	Форм-фактор памяти DIMM
	Суммарный объем памяти всего комплекта 16 ГБ
	Объем одного модуля памяти 8 ГБ
	Количество модулей в комплекте 2
	Регистровая память нет
	ECC-память нет
	Тактовая частота 2666 МГц', 3599);
    
USE configurator;

insert configurator.Finished_Assembly
(`users_id`, `first_name`,
`commodity_id_CPU_f`, `price_cpu`,
`commodity_id_motherboard_f`, `price_motherboard`,
`commodity_id_frame_f`, `price_frame`,
`commodity_id_GPU_f`, `price_GPU`,
`commodity_id_CPU_Cooling_f`, `price_CPU_Cooling`,
`commodity_id_RAM_f`, `price_RAM`,
`commodity_id_DATA_storage_f`, `price_DATA_storage`,
`commodity_id_Power_Supply_f`, `price_Power_Supply`,
`case_fans_id_f`, `price_case_fans_f`)

SELECT
	configurator.users.id, configurator.users.first_name,
	configurator.CPU.commodity_id_CPU, configurator.CPU.price_cpu,
    configurator.motherboard.commodity_id_motherboard, configurator.motherboard.price_motherboard,
    configurator.frame.commodity_id_frame, configurator.frame.price_frame,
    configurator.GPU.commodity_id_GPU, configurator.GPU.price_GPU,
    configurator.CPU_Cooling.commodity_id_CPU_Cooling, configurator.CPU_Cooling.price_CPU_Cooling,
    configurator.RAM.commodity_id_RAM, configurator.RAM.price_RAM,
    configurator.DATA_storage.commodity_id_DATA_storage, configurator.DATA_storage.price_DATA_storage,
    configurator.Power_Supply.commodity_id_Power_Supply, configurator.Power_Supply.price_Power_Supply,
    configurator.case_fans.case_fans_id, configurator.case_fans.price_case_fans


FROM users, case_fans, CPU, CPU_Cooling, DATA_storage, frame, GPU, motherboard, Power_Supply, RAM
WHERE
	configurator.users.id = 2 and
    configurator.case_fans.case_fans_id = 51 and
    configurator.CPU.commodity_id_CPU = 5 and
    configurator.CPU_Cooling.commodity_id_CPU_Cooling = 53 and
    configurator.DATA_storage.commodity_id_DATA_storage = 2 and
    configurator.frame.commodity_id_frame = 1 and
    configurator.GPU.commodity_id_GPU = 2 and
    configurator.motherboard.commodity_id_motherboard = 1 and
    configurator.Power_Supply.commodity_id_Power_Supply = 4 and
    configurator.RAM.commodity_id_RAM = 2;